Catalogs/питМеню.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>питМеню</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>MRS_КодSimphony</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Рецептура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.питРецептура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Выключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/MRS_ОчередьВыгрузкиМенюSimphony.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>MRS_ОчередьВыгрузкиМенюSimphony</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Операция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.MRS_СтатусыСинхронизацииSimphony</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПостановкиВОчередь</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СледующаяПопытка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПозицияМеню</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.питМеню</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КассовыйУзел</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.питУдаленныеКассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/MRS_ИсторияСинхронизацииМенюSimphony.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>MRS_ИсторияСинхронизацииМенюSimphony</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>HTTPСтатус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьМс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПозицияМеню</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.питМеню</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/питМеню/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Модуль справочника

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем СтарыйВидМеню;				// Владелец меню перед сменой владельца (вида меню)

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА


// Возвращает структуру обязательных / уникальных реквизитов элемента.
// Если ДляЭлемента = Истина, возвращаемая структура содержит реквизиты для проверки элемента.
// Если ДляГруппы = Истина, аналогично для группы
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей.
// Для реквизита значение структуры содержит число 1-Обязательный, 3-Уникальный.
//
// Параметры:
//  ДляЭлемента	– Булево			– Возвращаемая структура должна содержать реквизиты для проверки элемента.
//  ДляГруппы	– Булево 			– Возвращаемая структура должна содержать реквизиты для проверки группы элементов.
//
// Возвращаемое значение:
//   ОбязательныеРеквизиты   		– Структура, содержащая реквизиты для проверки элемента или группы элементов.
//
Функция ПолучитьОбязательныеРеквизиты(ДляЭлемента=Истина, ДляГруппы=Ложь) Экспорт
	ОбязательныеРеквизиты	= Новый Структура();
		
	Если ДляЭлемента Тогда
	КонецЕсли;
	
	Если ДляГруппы Тогда
	КонецЕсли;
	
	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку с описанием возникших ошибок "Ошибки".
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки.
// Может управляться флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные).
// Обычно выполняется универсальным обработчиком, но могут быть добавлены дополнительные проверки.
//
// Параметры:
//  Ошибки 			– Строка		– Описание ошибок.
//  ДопРеквизиты	– Структура		– Дополнительные реквизиты для проверки.
//  Заполнение		– Булево		– Флаг для проверки заполнения.
//  Уникальность	– Булево		– Флаг для проверки уникальности.
//
// Возвращаемое значение:
//   Булево				   			– Правильность заполнения объекта.
//
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	Корректность = питОбщегоНазначения.ПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	Если НЕ Корректность Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстОшибки = "";
	Если НЕ Справочники.питМеню.ПроверитьДопустимыйВидНоменклатуры(Номенклатура, ТекстОшибки) Тогда
		Ошибки = СокрЛП(Ошибки + Символы.ПС + ТекстОшибки);
		Возврат Ложь;
	КонецЕсли; 
	
	Возврат Истина;
	
КонецФункции // ПроверитьКорректность()


// Возвращает максимальный номер в группе
//
// Возвращаемое значение:
//	Число - максимальный номер в группе справочника "питМеню".
//
Функция ПолучитьМаксимальныйНомерВГруппе() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(Меню.НомерВГруппе), 0) КАК НомерВГруппе
	|ИЗ
	|	Справочник.питМеню КАК Меню
	|ГДЕ
	|	Меню.Родитель = &Родитель
	|	И Меню.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Родитель", Родитель);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	Результат	= Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	МаксНомер	= 0;
	Если Выборка.Следующий() Тогда
		МаксНомер	= Выборка.НомерВГруппе;
	КонецЕсли;
	Возврат МаксНомер;	
	
КонецФункции

// Проверка уникальности товара в прайсе.
//
// Параметры:
//	ТекущийПрайсЛист - СправочникСсылка - Элемент списка прайс-листа.
//
// Возвращаемое значение:
//	Булево	- Уникальность товара
//
Функция ТоварУникаленВПрайсе(ТекущийПрайсЛист) Экспорт
	СтрокаУникальность = ?(ТекущийПрайсЛист.ЭтоГруппа,"Наименование","Номенклатура");
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	ПрайсЛист." +СтрокаУникальность+"
	|ИЗ
	|	Справочник.питМеню КАК ПрайсЛист
	|ГДЕ
	|ПрайсЛист."+СтрокаУникальность+" = &ИсходнаяНоменклатура И
	|ПрайсЛист.Ссылка <> &ИсходныйПрайсЛист И
	|ПрайсЛист.Владелец = &ИсходныйВладелец
	|");
	Запрос.УстановитьПараметр("ИсходнаяНоменклатура",?(ТекущийПрайсЛист.ЭтоГруппа,ТекущийПрайсЛист.Наименование,ТекущийПрайсЛист.Номенклатура));
	Запрос.УстановитьПараметр("ИсходныйПрайсЛист",ТекущийПрайсЛист.Ссылка);
	Запрос.УстановитьПараметр("ИсходныйВладелец",ТекущийПрайсЛист.Владелец);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()<>0 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции // ТоварУникаленВПрайсе()

// Запросом получается выборка, упорядоченная по номеру в группе и каждый элемент выборки заново меняет номер.
//
// Параметры:
//	НоваяНумерация - Булево - признак новой нумерации
//
Процедура ПеренумероватьЭлементы(НоваяНумерация = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрайсЛист.НомерВГруппе КАК НомерВГруппе,
	|	ПрайсЛист.Ссылка
	|ИЗ
	|	Справочник.питМеню КАК ПрайсЛист
	|ГДЕ
	|	ПрайсЛист.Родитель = &Родитель
	|	И ПрайсЛист.Владелец = &Владелец
	|	И НЕ ПрайсЛист.Ссылка = &Ссылка 
	|УПОРЯДОЧИТЬ ПО
	|	НомерВГруппе";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Если НоваяНумерация Тогда
		парРодитель = Ссылка.Родитель;
		Запрос.УстановитьПараметр("Ссылка", Справочники.питМеню.ПустаяСсылка());
	Иначе
		парРодитель = Ссылка.Родитель;
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Родитель", парРодитель);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ТекНомер = 0;
	
	Пока Выборка.Следующий() Цикл
		ТекНомер = ТекНомер + 1;
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.НомерВГруппе = ТекНомер;
		Попытка
			СпрОбъект.ОбменДанными.Загрузка = Истина;
			СпрОбъект.ДополнительныеСвойства.Вставить("НеУникальностьНомера", НЕ НоваяНумерация);
			СпрОбъект.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), СпрОбъект);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

// Стандартный обработчик ПередЗаписью элемента справочника
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	// Проверим, заполнен ли номер в группе
	// если забыли присвоить.
	Если НомерВГруппе = 0 ИЛИ НЕ ЭтотОбъект.Родитель = Ссылка.Родитель Тогда
		МаксНомер = ПолучитьМаксимальныйНомерВГруппе();
		НомерВГруппе = МаксНомер + 1;
		Если НЕ ЭтотОбъект.Родитель = Ссылка.Родитель И НЕ ЭтоНовый() Тогда
			// При смене родителя не забудем заново пронумеровать элементы старой группы.
			ПеренумероватьЭлементы();
		КонецЕсли;
	КонецЕсли;
	
	ДопРеквизиты	= Неопределено;
	Заполнение		= Истина;
	Уникальность	= Истина;
	ПроизошлаОшибка	= Ложь;
	ТекстОшибки		= "";
	
	// Выполним проверку корректности заполнения
	Если Не ЭтотОбъект.ПометкаУдаления Тогда
		ПроизошлаОшибка = Не ПроверитьКорректность(ТекстОшибки, ДопРеквизиты, Заполнение, Уникальность);
	КонецЕсли; 
	
	// Индикация ошибок
	Если (ПроизошлаОшибка) И (Не ПустаяСтрока(ТекстОшибки)) Тогда
		Имя		= ЭтотОбъект.Метаданные().Представление();
		ТекстСообщения	= "Перед записью элемента - "+Имя+":"""+СокрЛП(ЭтотОбъект)+""" обнаружены ошибки :
		|"+ТекстОшибки;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , ,Отказ);
	КонецЕсли;	
	
	СтарыйВидМеню = Ссылка.Владелец;
КонецПроцедуры // ПередЗаписью()

// Стандартный обработчик ПередУдалением элемента.
Процедура ПередУдалением(Отказ)
	
	Попытка
		// Для редких случаев, когда ЭтотОбъект неопределен
		// проверку на режим обмена данными делаем через попытку.
		Если ОбменДанными.Загрузка Тогда
			Возврат;
		КонецЕсли;
	Исключение 
	КонецПопытки;
	
	ПеренумероватьЭлементы();
	
	Если ЗначениеЗаполнено(MRS_КодSimphony) Тогда

		КассовыйУзел = ПолучитьКассовыйУзелДляПозиции(Владелец);

		Если ЗначениеЗаполнено(КассовыйУзел) Тогда
			MRS_ИнтеграцияSimphonyСервер.ДобавитьВОчередьВыгрузки(Ссылка, "DELETE", КассовыйУзел);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Определяем, нужно ли ставить в очередь
	 ТребуетсяВыгрузка = Ложь;
	
	// Получаем кассовый узел для проверки
	КассовыйУзел = ПолучитьКассовыйУзелДляПозиции(Владелец);
	
	// Проверяем наличие записи в регистре очереди
	НаборЗаписей = РегистрыСведений.MRS_ОчередьВыгрузкиМенюSimphony.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПозицияМеню.Установить(Ссылка);
	НаборЗаписей.Отбор.КассовыйУзел.Установить(КассовыйУзел);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		// Записи нет в очереди - ставим статус НеВыгружено и требуется выгрузка
		ТребуетсяВыгрузка = Истина;
		СтатусСинхронизацииSimphony = Перечисления.MRS_СтатусыСинхронизацииSimphony.НеВыгружено;
		
	Иначе
         // Проверяем, изменились ли поля, требующие синхронизации
         ИзмененныеПоля = Новый Массив;
         ИзмененныеПоля.Добавить("Наименование");
         ИзмененныеПоля.Добавить("Номенклатура");
         ИзмененныеПоля.Добавить("Выключен");
		
         ДанныеДоИзменения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, ИзмененныеПоля);
		
         Для Каждого Поле Из ИзмененныеПоля Цикл
			
             Если ЭтотОбъект[Поле] <> ДанныеДоИзменения[Поле] Тогда
                 ТребуетсяВыгрузка = Истина;
                 Прервать;
             КонецЕсли;
			
         КонецЦикла;
	 КонецЕсли;
	
	 Если ТребуетсяВыгрузка И ЗначениеЗаполнено(КассовыйУзел) Тогда
		
		// Определяем операцию на основе истории синхронизации
		Операция = "CREATE";
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК Поле1
		|ИЗ
		|	РегистрСведений.MRS_ИсторияСинхронизацииМенюSimphony КАК ИсторияСинхронизации
		|ГДЕ
		|	ИсторияСинхронизации.ПозицияМеню = &ПозицияМеню";
		
		Запрос.УстановитьПараметр("ПозицияМеню", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Операция = "UPDATE";
		КонецЕсли;
		
		MRS_ИнтеграцияSimphonyСервер.ДобавитьВОчередьВыгрузки(Ссылка, Операция, КассовыйУзел);
		
	 КонецЕсли;
 КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#Область СлужебныеПроцедурыИФункции

// Получает кассовый узел для позиции меню
//
// Возвращаемое значение:
//  ПланОбменаСсылка.питУдаленныеКассы - кассовый узел
//
Функция ПолучитьКассовыйУзелДляПозиции(ВидМеню)
	
	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	питУдаленныеКассыВидыМеню.Ссылка КАК КассовыйУзел,
	|	питУдаленныеКассыВидыМеню.Ссылка.Префикс КАК Префикс
	|ИЗ
	|	ПланОбмена.питУдаленныеКассы.ВидыМеню КАК питУдаленныеКассыВидыМеню
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.питВидыМеню КАК питВидыМеню
	|		ПО (питУдаленныеКассыВидыМеню.ВидМеню = питВидыМеню.Ссылка)
	|ГДЕ
	|	питВидыМеню.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", ВидМеню);//(Справочники.питВидыМеню)
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КассовыйУзел;
	КонецЦикла;;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
#КонецЕсли
